In [53]:
!pip install pandas


import numpy as np
import pandas as pd
heroes_information = pd.read_csv("heroes_information.csv")

Requirement already satisfied: pandas in c:\users\barri\anaconda\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\barri\anaconda\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\barri\anaconda\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\barri\anaconda\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\barri\anaconda\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\barri\anaconda\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [54]:
###instalar desde anaconda navigator######
####pandasql
####mysql
####mysql-connector-c
####mysql-connector-python

!pip install pandasql

from pandasql import *

Requirement already satisfied: pandasql in c:\users\barri\anaconda\lib\site-packages (0.7.3)
Requirement already satisfied: numpy in c:\users\barri\anaconda\lib\site-packages (from pandasql) (1.26.4)
Requirement already satisfied: pandas in c:\users\barri\anaconda\lib\site-packages (from pandasql) (2.2.2)
Requirement already satisfied: sqlalchemy in c:\users\barri\anaconda\lib\site-packages (from pandasql) (2.0.30)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\barri\anaconda\lib\site-packages (from pandas->pandasql) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\barri\anaconda\lib\site-packages (from pandas->pandasql) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\barri\anaconda\lib\site-packages (from pandas->pandasql) (2023.3)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\barri\anaconda\lib\site-packages (from sqlalchemy->pandasql) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\barri\anaconda\lib\site-packages (from sqlalchemy->pandasql) (3.0.1)
Requirement already satisfied: six>=1.5 in c:\users\barri\anaconda\lib\site-packages (from python-dateutil>=2.8.2->pandas->pandasql) (1.16.0)

In [55]:
####para enlistar los documentos en el directorio#####
os.listdir()

['.ipynb_checkpoints',
 'Daa Wrangling',
 'heroes_information.csv',
 'SQL Competition.ipynb']

In [56]:
pysqldf = lambda q: sqldf(q,globals())

In [57]:
query2 = " SELECT * FROM heroes_information limit 10"

In [58]:
pysqldf(query2)

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,0,A-Bomb,Male,yellow,Human,No Hair,203.0,Marvel Comics,None,good,441.0
1,1,Abe Sapien,Male,blue,Icthyo Sapien,No Hair,191.0,Dark Horse Comics,blue,good,65.0
2,2,Abin Sur,Male,blue,Ungaran,No Hair,185.0,DC Comics,red,good,90.0
3,3,Abomination,Male,green,Human / Radiation,No Hair,203.0,Marvel Comics,None,bad,441.0
4,4,Abraxas,Male,blue,Cosmic Entity,Black,-99.0,Marvel Comics,None,bad,-99.0
5,5,Absorbing Man,Male,blue,Human,No Hair,193.0,Marvel Comics,None,bad,122.0
6,6,Adam Monroe,Male,blue,None,Blond,-99.0,NBC - Heroes,None,good,-99.0
7,7,Adam Strange,Male,blue,Human,Blond,185.0,DC Comics,None,good,88.0
8,8,Agent 13,Female,blue,None,Blond,173.0,Marvel Comics,None,good,61.0
9,9,Agent Bob,Male,brown,Human,Brown,178.0,Marvel Comics,None,good,81.0

In [76]:
query1 = """
SELECT *
FROM heroes_information
WHERE Race='Human'
AND Height > 200;

"""

In [78]:
pysqldf(query1)

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,2,Abin Sur,Male,blue,Ungaran,No Hair,185.0,DC Comics,red,good,90.0

In [107]:
query3 = """
SELECT publisher, COUNT(*) as count
FROM heroes_information
GROUP BY publisher;
"""

In [109]:
pysqldf(query3)

            Publisher  count
0                None     15
1         ABC Studios      4
2           DC Comics    215
3   Dark Horse Comics     18
4        George Lucas     14
5       Hanna-Barbera      1
6       HarperCollins      6
7      IDW Publishing      4
8         Icon Comics      4
9        Image Comics     14
10      J. K. Rowling      1
11   J. R. R. Tolkien      1
12      Marvel Comics    388
13          Microsoft      1
14       NBC - Heroes     19
15          Rebellion      1
16           Shueisha      4
17      Sony Pictures      2
18         South Park      1
19          Star Trek      6
20               SyFy      5
21       Team Epic TV      5
22        Titan Books      1
23  Universal Studios      1
24          Wildstorm      3

In [111]:
query4 = """
SELECT COUNT(*) as num_heroes
FROM heroes_information
WHERE Height > 200;
"""

pysqldf(query4)

   num_heroes
0          59

In [113]:
query5 = """
SELECT COUNT(*) as num_heroes
FROM heroes_information
WHERE Race = 'Human' AND Height > 200;
"""

pysqldf(query5)

   num_heroes
0          12

In [115]:
query6 = """
SELECT COUNT(*) as num_heroes
FROM heroes_information
WHERE Weight > 100 AND Weight < 200;

"""
pysqldf(query6)

   num_heroes
0          98

In [132]:
query7 = """
SELECT COUNT(*) as num_publishers
FROM (
    SELECT "Publisher", COUNT(*) as num_heroes
    FROM heroes_information
    GROUP BY "Publisher"
    HAVING COUNT(*) > 15
) as subquery;

"""
pysqldf(query7)

   num_publishers
0               4

In [ ]:
query7